<template>
  <div class="transaction-record-wrapper">
    <div class="title">日交易量实时数据</div>
    <dv-scroll-board :config="config" />
  </div>
</template>

<script>
export default {
  data() {
    return {
      config: {
        header: ['菜场名称', '商户数', '日交易额', '日交易量', '交易次数', '联系人', '联系电话'],
        data: [
          ['行1列1', '行1列2', '行1列3', '行1列4', '行1列5', '行1列6', '行1列7'],
          ['行2列1', '行2列2', '行2列3', '行2列3', '行2列3', '行2列3', '行2列3'],
          ['行3列1', '行3列2', '行3列3', '行3列3', '行3列3', '行3列3', '行3列3'],
          ['行4列1', '行4列2', '行4列3', '行4列3', '行4列3', '行4列3', '行4列3'],
          ['行5列1', '行5列2', '行5列3', '行5列3', '行5列3', '行5列3', '行5列3'],
          ['行6列1', '行6列2', '行6列3', '行6列3', '行6列3', '行6列3', '行6列3'],
          ['行7列1', '行7列2', '行7列3', '行7列3', '行7列3', '行7列3', '行7列3'],
          ['行8列1', '行8列2', '行8列3', '行8列3', '行8列3', '行8列3', '行8列3'],
          ['行9列1', '行9列2', '行9列3', '行8列3', '行8列3', '行8列3', '行8列3'],
          ['行10列1', '行10列2', '行10列3', '行8列3', '行8列3', '行8列3', '行8列3'],
          ['行1列1', '行1列2', '行1列3', '行1列4', '行1列5', '行1列6', '行1列7'],
          ['行2列1', '行2列2', '行2列3', '行2列3', '行2列3', '行2列3', '行2列3'],
          ['行3列1', '行3列2', '行3列3', '行3列3', '行3列3', '行3列3', '行3列3'],
          ['行4列1', '行4列2', '行4列3', '行4列3', '行4列3', '行4列3', '行4列3'],
          ['行5列1', '行5列2', '行5列3', '行5列3', '行5列3', '行5列3', '行5列3'],
          ['行6列1', '行6列2', '行6列3', '行6列3', '行6列3', '行6列3', '行6列3'],
          ['行7列1', '行7列2', '行7列3', '行7列3', '行7列3', '行7列3', '行7列3'],
          ['行8列1', '行8列2', '行8列3', '行8列3', '行8列3', '行8列3', '行8列3'],
          ['行9列1', '行9列2', '行9列3', '行8列3', '行8列3', '行8列3', '行8列3'],
          ['行10列1', '行10列2', '行10列3', '行8列3', '行8列3', '行8列3', '行8列3'],
        ],
        rowNum: 8,
        index: true,
        headerBGC: '#002766',
        columnWidth: [70],
        align: ['center'],
        oddRowBGC: 'rgba(0, 59, 81, 0.4)',
        evenRowBGC: 'rgba(10, 39, 50,0.3)',
      },
    }
  },
}
</script>

<style lang="stylus" scoped>
@import '~assets/stylus/common'
.transaction-record-wrapper
  overflow hidden
  box-sizing border-box
  padding-top 5px
  width 100%
  height 100%
  title()
  letter-spacing 4px
  .dv-scroll-board
    box-sizing border-box
    // margin-bottom 60px
    padding-top 5px
</style>
